2018/9/27 Updates

Changes
1. More columns convertions to proper datatypes
2. New dataframe created for future manipulations
3. Entry and exit tracking numbers combined for each turnstile reporting
4. Hours elapsed since previous reporting tracked
5. Passenger per hour per turntiles tracked


Next steps:
2. Rate for each station by hour (groupby station, day, hour)


ID explained 
Station then Unit(think enterance maybe) then CA(booth) then SCP(turnstyle)

In [1]:
import pandas as pd
import re

In [2]:
#changes float views from scientific to ???? (what would you call the other view?)
pd.set_option('display.float_format', lambda x: '%.3f' % x)

In [3]:
#load April - July, 2017 & 2018 MTA Turntile data
#time intensive block
df = pd.read_csv('/Users/charlieyaris/turnstile_recordings_summer_2017_2018_clean.csv', index_col = 'Unnamed: 0')
df.head()

/Users/charlieyaris/.venvs/lpthw/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2785: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)
/Users/charlieyaris/.venvs/lpthw/lib/python3.6/site-packages/numpy/lib/arraysetops.py:522: FutureWarning: elementwise comparison failed; returning scalar instead, but in the future will perform elementwise comparison
  mask |= (ar1 == a)

,c_a,unit,scp,station,linename,division,date,time,desc,entries,exits
0,"[""A002",R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,00:00:00,REGULAR,6157740,2085315
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,04:00:00,REGULAR,6157777,2085319
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,08:00:00,REGULAR,6157810,2085353
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,12:00:00,REGULAR,6157963,2085453
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,16:00:00,REGULAR,6158212,2085529

In [4]:
#exit column has a few misplaced chars preventing the column from being int values
#this block removes the chars and converts columns to int64

#apply regex statement to ensure only numbers in the column
def only_num(col):
    return re.findall('(\d)', col)
df.exits = df.exits.apply(lambda x: only_num(str(x)))

#the regex statment returns a list a numbers for each value
#join list values to single string items of numbers
df.exits = df.exits.apply(lambda x: ''.join(x))

#convert str to int64
df.exits = df.exits.apply(lambda x: int(x))

df.head()

,c_a,unit,scp,station,linename,division,date,time,desc,entries,exits
0,"[""A002",R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,00:00:00,REGULAR,6157740,2085315
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,04:00:00,REGULAR,6157777,2085319
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,08:00:00,REGULAR,6157810,2085353
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,12:00:00,REGULAR,6157963,2085453
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,04/29/2017,16:00:00,REGULAR,6158212,2085529

In [5]:
#dropped df.date conversion - which was a speparate from the date_time combine conversion

#combine and convert date,time column from str to datetime
#time intensive block, run then take 5

#df.date = pd.to_datetime(df.date_time, infer_datetime_format= True)
df.time = pd.to_datetime(df.date + ' ' + df.time)

#rename to showcase the new time feature in the column
df.rename({'time': 'date_time'}, axis = 'columns', inplace = True)

#removes the now date time column
df.drop(columns = ['date'], inplace = True)

df.head()

,c_a,unit,scp,station,linename,division,date_time,desc,entries,exits
0,"[""A002",R051,02-00-00,59 ST,NQR456W,BMT,2017-04-29 00:00:00,REGULAR,6157740,2085315
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,2017-04-29 04:00:00,REGULAR,6157777,2085319
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,2017-04-29 08:00:00,REGULAR,6157810,2085353
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,2017-04-29 12:00:00,REGULAR,6157963,2085453
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,2017-04-29 16:00:00,REGULAR,6158212,2085529

In [23]:
#ensure that date_time is increasing in chronical order
#this is helpful later when grouping by turnstiles and station
df = df.sort_values(by = 'date_time', ascending = True)

In [24]:
#create pickle for quicker processing time
df.to_pickle('date_formatted_df.pkl')

In [107]:
df = pd.read_pickle('date_formatted_df.pkl')

In [108]:
# remove dates before May and after August
df = df[(df.date_time.dt.month != 4) & (df.date_time.dt.month != 8)].reset_index()
df.head()

,level_0,index,c_a,unit,scp,station,linename,division,date_time,desc,entries,exits
0,0,47893,N057,R188,00-05-00,50 ST,CE,IND,2017-05-01,REGULAR,2902,0
1,672,14379,B016,R098,00-03-01,CHURCH AV,BQ,BMT,2017-05-01,REGULAR,4576418,2346622
2,673,58650,N101,R252,01-00-00,HIGH ST,AC,IND,2017-05-01,REGULAR,3166500,11138566
3,674,50712,N067,R012,00-06-00,34 ST-PENN STA,ACE,IND,2017-05-01,REGULAR,4237,0
4,675,60336,N108,R217,00-00-04,HOYT-SCHER,ACG,IND,2017-05-01,REGULAR,8569219,9797016

In [109]:
df.groupby(['station', 'unit', 'c_a', 'scp'])['entries'].apply(lambda x: x - x.shift(1))

0              nan
1              nan
2              nan
3              nan
4              nan
5              nan
6              nan
7              nan
8              nan
9              nan
10             nan
11             nan
12             nan
13             nan
14             nan
15             nan
16             nan
17             nan
18             nan
19             nan
20             nan
21             nan
22             nan
23             nan
24             nan
25             nan
26             nan
27             nan
28             nan
29             nan
            ...
2005822   1173.000
2005823    452.000
2005824    504.000
2005825      0.000
2005826     82.000
2005827    133.000
2005828    368.000
2005829      0.000
2005830      0.000
2005831     21.000
2005832      0.000
2005833     47.000
2005834    317.000
2005835     21.000
2005836    187.000
2005837    312.000
2005838    182.000
2005839    276.000
2005840    160.000
2005841     48.000
2005842     87.000
2005843      0.000
2005844    276.000
2005845      0.000
2005846     63.000
2005847     70.000
2005848    146.000
2005849     39.000
2005850    168.000
2005851    220.000
Name: entries, Length: 2005852, dtype: float64

In [110]:
#replace typo in c_a column
df.loc[df['c_a'] == ' "A002', 'c_a'] = 'A002'

In [111]:
# grouping by turnstile id (station, unit, c_a, scp), find the difference between consecutive data points
# for each individual turnstile. This method is applied to both the exit, entry, and date_time for each observation
entries_difference_series = df.groupby(['station', 'unit', 'c_a', 'scp'])['entries'].apply(lambda x: x - x.shift(1))
exits_difference_series = df.groupby(['station', 'unit', 'c_a', 'scp'])['exits'].apply(lambda x: x - x.shift(1))
time_elapsed_series = df.groupby(['station', 'unit', 'c_a', 'scp'])['date_time'].apply(lambda x: x - x.shift(1))

#these 3 series are ardded to a temp data frame that will be merged to the main dataframe
temp_df = pd.DataFrame({'Index': df.index, 'num_entries': entries_difference_series, 'num_exits': exits_difference_series, 'time_elapsed': time_elapsed_series})

In [112]:
temp_df.head()

   Index  num_entries  num_exits time_elapsed
0      0          nan        nan          NaT
1      1          nan        nan          NaT
2      2          nan        nan          NaT
3      3          nan        nan          NaT
4      4          nan        nan          NaT

In [113]:
# creating a new dataframe for grouping at the turnstile level
# time intensive, run then take 5
# merge the main and temp df on the index column
turnstile_df = pd.concat([df, temp_df], axis = 1, join = 'outer')
turnstile_df.head()

,level_0,index,c_a,unit,scp,station,linename,division,date_time,desc,entries,exits,Index,num_entries,num_exits,time_elapsed
0,0,47893,N057,R188,00-05-00,50 ST,CE,IND,2017-05-01,REGULAR,2902,0,0,nan,nan,NaT
1,672,14379,B016,R098,00-03-01,CHURCH AV,BQ,BMT,2017-05-01,REGULAR,4576418,2346622,1,nan,nan,NaT
2,673,58650,N101,R252,01-00-00,HIGH ST,AC,IND,2017-05-01,REGULAR,3166500,11138566,2,nan,nan,NaT
3,674,50712,N067,R012,00-06-00,34 ST-PENN STA,ACE,IND,2017-05-01,REGULAR,4237,0,3,nan,nan,NaT
4,675,60336,N108,R217,00-00-04,HOYT-SCHER,ACG,IND,2017-05-01,REGULAR,8569219,9797016,4,nan,nan,NaT

In [114]:
# removed all rows where the time elapsed was greater than 60 days
#This drops 1.8% of the data
turnstile_df = turnstile_df[turnstile_df['time_elapsed'].dt.days <= 60]

In [115]:
# removed rows with negative time elapses.
# needed to be greated than OR equal to because all time elapses within 24 hours are 0 or dt.days
#This removed 0% of the data
turnstile_df = turnstile_df[turnstile_df['time_elapsed'].dt.days >= 0]

In [116]:
#This should later be moved to a later section, where the columns are defined
'''
Create a variable that tracks the rate of passengers for each turnstile per hour

Numerator: add the num enteries/exit per observation that was found before the merge.
This gives total foot traffic per turnstile per observation

Denominator: time elapsed provides the difference between each observation for each turnstile.
This observation can be pulled by full days (year,mont, day converted to day) 
and partial day (hour, min, seconds to seconds).
For each observation the full and partial day info is converted to seconds (24hours*60min*60sec = 86400seconds)
then converted back to hour format (60min*60seconds = 3600 seconds)

'''
turnstile_df['passengers_per_hour_per_turnstile'] = (turnstile_df.num_entries + turnstile_df.num_exits) \
/(((turnstile_df.time_elapsed.dt.days * 86400) + (turnstile_df.time_elapsed.dt.seconds))/3600)

In [117]:
# remove outliers for passengers per hour per turnstile that are greater than 1000
# this removes .01% of the data
turnstile_df = turnstile_df[turnstile_df['passengers_per_hour_per_turnstile'] < 1000]

In [118]:
# removed all rows where the num_entries OR the num_exits was less than or equal to 0
# logically, turnstiles should alway be increasing throughout time. However, due to errors in the systems
# such as resets there can be cases of negative values

# This removes 16.65% of the data
turnstile_df = turnstile_df[(turnstile_df['num_entries'] > 0) & (turnstile_df['num_exits'] > 0)]

In [119]:
#see above for long block using these equations before defining variable
#variable should have a different name, total passengers per turnstiles or something

# combine total passengers for each turnstile reporting
turnstile_df['total_passengers'] = turnstile_df.num_entries + turnstile_df.num_exits
turnstile_df.head()

,level_0,index,c_a,unit,scp,station,linename,division,date_time,desc,entries,exits,Index,num_entries,num_exits,time_elapsed,passengers_per_hour_per_turnstile,total_passengers
1804,2482,2283,A015,R081,00-00-03,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,7751120,3504856,1804,30.000,1.000,04:00:00,7.750,31.000
1806,2475,21680,C016,R278,00-00-01,25 ST,R,BMT,2017-05-01 04:00:00,REGULAR,831741,225857,1806,2.000,2.000,04:00:00,1.000,4.000
1807,2485,2199,A015,R081,00-00-01,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,4334888,857159,1807,38.000,3.000,04:00:00,10.250,41.000
1808,2484,2241,A015,R081,00-00-02,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,2622414,504837,1808,26.000,2.000,04:00:00,7.000,28.000
1809,2481,2834,A021,R032,01-00-05,TIMES SQ-42 ST,ACENQRS1237W,BMT,2017-05-01 04:00:00,REGULAR,1057891,3765947,1809,5.000,9.000,04:00:00,3.500,14.000

In [120]:
#see above for long block using these equations before defining variable


#create column tracking total hours passed for each turnstile reporting
turnstile_df['hours_elapsed'] = (((turnstile_df['time_elapsed'].dt.days * 86400) + (turnstile_df['time_elapsed'].dt.seconds)))/3600
turnstile_df.head()

,level_0,index,c_a,unit,scp,station,linename,division,date_time,desc,entries,exits,Index,num_entries,num_exits,time_elapsed,passengers_per_hour_per_turnstile,total_passengers,hours_elapsed
1804,2482,2283,A015,R081,00-00-03,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,7751120,3504856,1804,30.000,1.000,04:00:00,7.750,31.000,4.000
1806,2475,21680,C016,R278,00-00-01,25 ST,R,BMT,2017-05-01 04:00:00,REGULAR,831741,225857,1806,2.000,2.000,04:00:00,1.000,4.000,4.000
1807,2485,2199,A015,R081,00-00-01,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,4334888,857159,1807,38.000,3.000,04:00:00,10.250,41.000,4.000
1808,2484,2241,A015,R081,00-00-02,49 ST,NQRW,BMT,2017-05-01 04:00:00,REGULAR,2622414,504837,1808,26.000,2.000,04:00:00,7.000,28.000,4.000
1809,2481,2834,A021,R032,01-00-05,TIMES SQ-42 ST,ACENQRS1237W,BMT,2017-05-01 04:00:00,REGULAR,1057891,3765947,1809,5.000,9.000,04:00:00,3.500,14.000,4.000

In [121]:
#pickle the data frame
turnstile_df.to_pickle('turnstile_df.pkl')

In [122]:
turnstile_df = pd.read_pickle('turnstile_df.pkl')

In [123]:
# aggregations for new dataframe 'see below'
#grouping by station and time segment,
#sum across turnstiles in stations
#sum the hours elapsed for each grouping
#count the number of turnstiles in each grouping
#the sum of hours elapsed and turnstiles count should logically divide to the time elapsed
aggregations = {
    'total_passengers': 'sum',
    'hours_elapsed': 'sum',
    'num_entries': 'count'
}

In [124]:
# create a new dataframe by station by date
#apply aggregations from above
date_df = turnstile_df.groupby(('station','date_time')).agg(aggregations).reset_index()
date_df.rename({'hours_elapsed': 'turnstile_hours', 'num_entries': 'num_turnstiles'}, axis = 1, inplace = True)

/Users/charlieyaris/.venvs/lpthw/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: Interpreting tuple 'by' as a list of keys, rather than a single key. Use 'by=[...]' instead of 'by=(...)'. In the future, a tuple will always mean a single key.
  This is separate from the ipykernel package so we can avoid doing imports until

In [125]:
date_df.head()

,station,date_time,total_passengers,turnstile_hours,num_turnstiles
0,1 AV,2017-05-01 04:00:00,690.000,36.000,9
1,1 AV,2017-05-01 08:00:00,5100.000,40.000,10
2,1 AV,2017-05-01 12:00:00,10538.000,40.000,10
3,1 AV,2017-05-01 16:00:00,8687.000,40.000,10
4,1 AV,2017-05-01 20:00:00,12671.000,40.000,10

In [126]:
#these variables have been defined earlier, here we are rewriting
#passengers per hour is total passengers per station (summed turnstiles totals)

#for each turnstile reporting, finds the rate of passengers per hour
date_df['hours_elapsed'] = (date_df['turnstile_hours']/date_df['num_turnstiles'])
date_df['passengers_per_hour'] = date_df.total_passengers/date_df.hours_elapsed

In [127]:
date_df.head()

,station,date_time,total_passengers,turnstile_hours,num_turnstiles,hours_elapsed,passengers_per_hour
0,1 AV,2017-05-01 04:00:00,690.000,36.000,9,4.000,172.500
1,1 AV,2017-05-01 08:00:00,5100.000,40.000,10,4.000,1275.000
2,1 AV,2017-05-01 12:00:00,10538.000,40.000,10,4.000,2634.500
3,1 AV,2017-05-01 16:00:00,8687.000,40.000,10,4.000,2171.750
4,1 AV,2017-05-01 20:00:00,12671.000,40.000,10,4.000,3167.750

In [128]:
#pickle the data frame
date_df.to_pickle('date_df.pkl')

In [129]:
date_df = pd.read_pickle('date_df.pkl')

In [130]:
aggregations = {
    'total_passengers': 'sum',
    'num_turnstiles': 'sum',
    'date_time': 'count',
    'hours_elapsed': 'sum'
}

In [131]:
station_df = date_df.groupby(('station')).agg(aggregations).reset_index()
station_df['passengers_per_hour'] = station_df.total_passengers/station_df.hours_elapsed
station_df.rename({'hours_elapsed': 'station_hours', 'num_turnstiles': 'num_observations', 'date_time': 'date_time_count'}, axis = 1, inplace = True)
station_df['num_turnstiles'] = station_df.num_observations/station_df.date_time_count
station_df.head()

,station,total_passengers,num_observations,date_time_count,station_hours,passengers_per_hour,num_turnstiles
0,1 AV,7391182.000,10727,1104,4385.412,1685.402,9.716
1,103 ST,1485584.000,3242,1092,4351.403,341.403,2.969
2,104 ST,591491.000,5656,1107,4457.275,132.702,5.109
3,111 ST,1246868.000,9494,2152,8576.317,145.385,4.412
4,116 ST,1599273.000,4966,1093,4348.625,367.765,4.543

In [132]:
#pickle the data frame
station_df.to_pickle('station_df.pkl')

In [133]:
station_df = pd.read_pickle('station_df.pkl')